------------------------------------------------------------------------------------------
-- MaxUI 3.50 TukUI 17 - LEGION 7.0 -- version: 31-07-2016
------------------------------------------------------------------------------------------

--setting up Locales.

------------------------------------------------------------------------------------------
-- LOCALES
------------------------------------------------------------------------------------------

--setting up locales/descriptions for MaxUI and MaxUI config.

local T, C, L = Tukui:unpack()

if (GetLocale() ~= "ruRU") then
	return
end

------------------------------------------------------------------------------------------
-- MaxUI Layout Locales
------------------------------------------------------------------------------------------

local MaxUILayout = {

	-- MaxUI unitframes
		["MaxUIUF"] = {
			["Name"] = "MaxUI Unitframes",
			["Desc"] = "Enable/Disable the MaxUI styled Unitframes",
		},

	-- Layouts
		["Heallayout"] = {
			["Name"] = "Расположение лекаря/заклинателя",
			["Desc"] = "Включает расположение более подходящее лекарям/заклинателям, заточенное под центральную позицию рамок рейда для использования аддонов типа Clique, и панели комант 3x4 (отключает расположение ближнего боя).",
		},

		["Meleelayout"] = {
			["Name"] = "Расположение ближнего боя/танка",
			["Desc"] = "Включает базовое расположение с панелями команд 3x12 actionbars и рамками рейда в стороне (отключает расположение лекаря).",
		},
		
		["DPSlayout"] = {
			["Name"] = "Расположение ДД",
			["Desc"] = "Такой же, как расположение ближнего боя, за исключением рамки фокуса ближе к панелям команд. Не работает с расположением лекаря.",
		},

		["DPSCenterBar"] = {
			["Name"] = "Centered Layout",
			["Desc"] = "Centering Actionbar 4, in a 4 by 3 grid, between Player and Target frames, only works when Melee/Tank Layout is active, overrides DPS Layout.",
		},
		
		["MouseoverAB"] = {
			["Name"] = "Боковые панели команд при наведении",
			["Desc"] = "Включает/отключает функцию пказа при наведении курсора для правой и левой панелей команд (2 и 3). (WIP)",
		},
		
		["ClassResourcesAB"] = {
		["Name"] = "Class Powers on Actiobars",
		["Desc"] = "Anchor the cClass Powers/Resources/ComboBar to the castbarline's center, on top of the ActionBars.",
		},
		
	}
	
TukuiConfig.ruRU["MaxUI Layout"] = MaxUILayout

------------------------------------------------------------------------------------------
-- MaxUI Media Locales
------------------------------------------------------------------------------------------

local MaxUIMedia = {

	-- Media
		["Chatpanels"] = {
			["Name"] = "Фон чата",
			["Desc"] = "Делает фон чата видимым или скрытым при входе в игру.",
		},
	
		["Font"] = {
			["Name"] = "Единый шрифт UI",
			["Desc"] = "Устанавливает шрифты большинства панелей на Caps или Comic (WIP).",
		},
		
		["FontSize"] = {
		["Name"] = "Font Size (WIP)",
		["Desc"] = "Set the Font Size for most texts in the UI (WIP).",
		},

		["FontFlag"] = {
		["Name"] = "Font flag (WIP)",
		["Desc"] = "Set the Font Flag for most texts in the UI (WIP).",
		},
	
		["Texture"] = {
			["Name"] = "Текстура фона",
			["Desc"] = "Устанавливает выранную текстуру фоном для некоторых панелей интерфейса, например портретов и панелей чата, когда отключены классовые текстуры. (WIP)",
		},

		["ClassTexture"] = {
			["Name"] = "Классовые текстуры чата",
			["Desc"] = "Устанавливает классовые текстуры для фона панелей чата, отключает обычные текстуры.",
		},

		["MaxUIlogoChat"] = {
		["Name"] = "MaxUI Chat Backdrop",
		["Desc"] = "Set the MaxUI logo as backdrop for the chatpanels.",
		},
		
		["MaxUIrollicons"] = {
		["Name"] = "Created Roll Icons",
		["Desc"] = "Use the Roll Icons created for MaxUI, blue shield = tank, red sword = dps, green heart = healer",
		},
		
		["ActionbarClass"] = {
			["Name"] = "Классовые текстуры панелей команд",
			["Desc"] = "Устанавливает классовые текстуры для фона панелей команд.",
		},

		["Backdrop"] = {
			["Name"] = "Цвет фона рамок",
			["Desc"] = "Изменяет цвет фона на большинстве панелей/рамок, использующих текстуры. Базовый цвет - цвет класса. (WIP)",
		},
	
		["chatpanelalpha"] = {
		["Name"] = "Прозрачность фона чата",
		["Desc"] = "Устанавливает прозрачность фона чата. 0 = не видимый, 1 = нет прозрачности, базовое значение 0.4.",
		},
	}

TukuiConfig.ruRU["MaxUI Media"] = MaxUIMedia

------------------------------------------------------------------------------------------
-- MaxUI Tools Locales
------------------------------------------------------------------------------------------

local MaxUITools = {

	-- Tools

		["Masterlooter"] = {
			["Name"] = "Модуль ответственного за добычу",
			["Desc"] = "Включает/отключает модуль ответственного за добычу. (WIP)",
		},

		["Tools"] = {
			["Name"] = "Tools Module",
			["Desc"] = "Enable/Disable the Tools module.",
		},

		["RaidTools"] = {
			["Name"] = "Модуль инструментов рейда",
			["Desc"] = "Включить/выключить модуль инструментов рейда.",
		},
		
		["chattools"] = {
			["Name"] = " Инструменты/границы чата",
			["Desc"] = "Включает/отключает границы и инструменты чата.",
		},
		
		["MaxUIMenu"] = {
			["Name"] = "Показывать меню MaxUI",
			["Desc"] = "Включает/отключает меню MaxUI при входе в игру, пока еще работаю над показом только при первомвходе. (WIP)",
		},
				
		["Bottomline"] = {
			["Name"] = "Нижние инфо-тексты",
			["Desc"] = "Включает/отключает нижнюю полосу и соответственные инфо-тексты.",
		},
		
		["Topline"] = { 
			["Name"] = "Верхние инфо-тексты",
			["Desc"] = "Включает/отключает верхнюю полосу и соответственные инфо-тексты.",
		},

		["Locator"] = {
			["Name"] = "Позиция",
			["Desc"] = "Включает/отключает панель позиции в верхней части экрана.",
		},
		
		["Nomap"] = {
			["Name"] = "Видимость миникарты",
			["Desc"] = "Делает миникарту видимой или скрытой при входе в игру.",
		},
	}

TukuiConfig.ruRU["MaxUI Tools"] = MaxUITools

------------------------------------------------------------------------------------------
-- OTHER ADDITIONS
------------------------------------------------------------------------------------------


